{
 "Aphid": {
    "description": "Тля - мелкие сосущие насекомые, которые питаются соками растений, что приводит к ослаблению пшеницы и распространению вирусных заболеваний.",
    "general": "Используйте природных хищников, таких как божьи коровки, опрыскивайте мыльным раствором и в крайнем случае применяйте мягкие инсектициды.",
    "soil_specific": {
      "Глинистая": "Обеспечьте дренаж и ограничьте полив, чтобы избежать избыточной влажности, которая привлекает тлю. Рассмотрите использование природных репеллентов, таких как настой чеснока.",
      "Суглинистая": "Избегайте избытка удобрений, особенно азотных, чтобы не провоцировать вспышки тли. Поддерживайте биологический контроль, например, высаживая рядом растения, привлекающие божьих коровок.",
      "Известковая": "Периодически проверяйте растения на наличие тли, так как щелочная среда может привлекать вредителей. Используйте компост для выравнивания pH и защитных мер от тли.",
      "Песчаная": "Поливайте чаще, так как сухая почва менее привлекательна для хищных насекомых, борющихся с тлей. Используйте мульчирование, чтобы сохранить влагу.",
      "Супесчаная": "Обеспечьте дополнительные поливы и регулярное мульчирование, чтобы предотвратить пересыхание, которое привлекает вредителей.",
      "Болотистая": "Контролируйте уровень воды и обеспечьте постоянное использование биологического контроля, так как высокая влажность способствует размножению тли."
    }
  },
  "Black Rust": {
    "description": "Черная ржавчина - грибковое заболевание, вызываемое грибом Puccinia graminis, поражающее стебли, листья и колосья пшеницы",
    "general": "Высаживайте устойчивые сорта, используйте профилактические фунгициды и соблюдайте севооборот.",
    "soil_specific": {
      "Глинистая": "Улучшите дренаж и рыхлите почву, чтобы уменьшить избыточную влажность, создающую условия для ржавчины. Старайтесь избегать вечерних поливов.",
      "Суглинистая": "Сохраняйте здоровую почву, избегайте застойной влаги и регулярно проверяйте растения на начальные симптомы ржавчины.",
      "Известковая": "При повышенной щелочности внесите компост или органические добавки, чтобы создать среду, менее благоприятную для грибка.",
      "Песчаная": "Контролируйте влажность и, при необходимости, мульчируйте, чтобы сохранить баланс влаги.",
      "Супесчаная": "Песчаная структура хорошо удерживает воздух, но для профилактики ржавчины добавляйте органические вещества для увеличения удержания влаги.",
      "Болотистая": "Применяйте устойчивые сорта, удаляйте растительные остатки и избегайте избыточного увлажнения."
    }
  },
  "Blast": {
    "description": "Пирикуллиоз или взрывная болезнь - грибковая инфекция, вызванная Pyricularia grisea, поражает все части растения",
    "general": "Сократите использование азотных удобрений, контролируйте влажность и используйте превентивные фунгициды.",
    "soil_specific": {
      "Глинистая": "Поддерживайте хороший дренаж и минимизируйте использование азотных удобрений, чтобы предотвратить избыток влаги.",
      "Суглинистая": "Контролируйте количество поливов и старайтесь избегать удобрений с высоким содержанием азота.",
      "Известковая": "Регулярно проверяйте pH, чтобы не стимулировать рост грибка, вносите органику, чтобы создать оптимальную среду.",
      "Песчаная": "Поддерживайте частый, но умеренный полив, так как вода быстро уходит. Используйте мульчу для контроля влаги.",
      "Супесчаная": "Применяйте умеренный полив и добавляйте органику для улучшения удержания влаги, избегайте переизбытка азота.",
      "Болотистая": "Следите за уровнем влаги и применяйте фунгициды в периоды повышенной влажности."
    }
  },
  "Brown Rust": {
    "description": "Бурая ржавчина - заболевание, вызванное грибом Puccinia triticina, поражает в основном листья пшеницы",
    "general": "Используйте устойчивые сорта и соблюдайте регулярный севооборот.",
    "soil_specific": {
      "Глинистая": "Проводите умеренный полив, чтобы снизить влажность, и используйте устойчивые к грибкам сорта.",
      "Суглинистая": "Сохраняйте рыхлую структуру почвы и применяйте профилактические меры против грибка.",
      "Известковая": "Избегайте перенасыщения щелочью, добавляя органические вещества, и поддерживайте умеренный уровень влажности.",
      "Песчаная": "Сохранение частого полива необходимо для предотвращения сухости, которая может способствовать заражению.",
      "Супесчаная": "Используйте мульчирование для поддержания уровня влаги и предотвращения заражения.",
      "Болотистая": "Регулируйте дренаж, так как повышенная влажность создает благоприятные условия для грибка."
    }
  },
  "Common Root Rot": {
    "description": "Обычная корневая гниль - грибковая инфекция, поражающая корневую систему растений, чаще всего вызванная различными почвенными патогенами",
    "general": "Регулярно вносите органические удобрения и обеспечьте хороший дренаж.",
    "soil_specific": {
      "Глинистая": "Вносите компост для улучшения структуры почвы, обеспечивая воздухообмен и дренаж.",
      "Суглинистая": "Добавляйте органические удобрения для поддержания здоровья почвы и контролируйте влажность.",
      "Известковая": "Вносите органику для поддержания оптимальной микрофлоры корневой системы.",
      "Песчаная": "Из-за естественного дренажа добавляйте органические материалы, чтобы повысить удержание влаги.",
      "Супесчаная": "Добавляйте компост для улучшения плодородия и защиты от корневой гнили.",
      "Болотистая": "Постоянный контроль уровня воды и избегание избыточного увлажнения помогают снизить риск заражения."
    }
  },
  "Fusarium Head Blight": {
    "description": "Фузариоз колоса - опасное грибковое заболевание, вызванное грибами рода Fusarium, поражающее колосья и приводящее к накоплению микотоксинов",
    "general": "Используйте сертифицированные семена и применяйте фунгициды во время цветения.",
    "soil_specific": {
      "Глинистая": "Рыхлите почву для улучшения дренажа и применяйте фунгициды на ранней стадии развития.",
      "Суглинистая": "Севооборот и использование органики помогут снизить вероятность заражения.",
      "Известковая": "Поддерживайте нейтральный уровень pH для предотвращения вспышек болезни.",
      "Песчаная": "Добавляйте органику для улучшения удержания влаги, чтобы минимизировать стресс у растений.",
      "Супесчаная": "Чаще добавляйте компост для удержания влаги и поддержки микрофлоры.",
      "Болотистая": "Используйте фунгициды и удаляйте растительные остатки после уборки урожая для профилактики."
    }
  },
  "Healthy": {
    "description": "Здоровое растение",
    "general": "Поддерживайте правильные условия выращивания.",
    "soil_specific": {
      "Глинистая": "Регулярное рыхление и улучшение дренажа.",
      "Суглинистая": "Поддерживайте плодородие с помощью органики.",
      "Известковая": "Добавляйте органику для удержания влаги.",
      "Песчаная": "Поливайте чаще и используйте мульчу.",
      "Супесчаная": "Вносите органику для удержания влаги.",
      "Болотистая": "Контролируйте уровень воды."
    }
  },
  "Leaf Blight": {
    "description": "Пятнистость или гниль листьев - грибковые инфекции, вызывающие различные типы пятен на листьях пшеницы",
    "general": "Удаляйте зараженные листья и при необходимости применяйте фунгициды.",
    "soil_specific": {
      "Глинистая": "Обеспечьте дренаж и удаление старых листьев, чтобы улучшить циркуляцию воздуха.",
      "Суглинистая": "Контролируйте влажность и избегайте загущенности, чтобы предотвратить вспышки.",
      "Известковая": "Сократите полив и удаляйте зараженные листья, чтобы избежать разрастания болезни.",
      "Песчаная": "Поддерживайте регулярный полив и применяйте мульчу для удержания влаги.",
      "Супесчаная": "Частое мульчирование помогает контролировать влажность и предотвращать гниль.",
      "Болотистая": "Проветривайте, чтобы уменьшить риск заражения, и сократите полив в сезон дождей."
    }
  },
  "Mildew": {
    "description": "Мучнистая роса - грибковое заболевание, вызываемое грибом Blumeria graminis, которое покрывает листья белым мучнистым налетом.",
    "general": "Удаляйте зараженные части растений, применяйте фунгициды на основе серы или меди и обеспечьте циркуляцию воздуха.",
    "soil_specific": {
      "Глинистая": "Улучшите дренаж, чтобы избежать застоя воды. Удаляйте зараженные листья и обеспечьте циркуляцию воздуха.",
      "Суглинистая": "Сократите полив, чтобы избежать высокой влажности. При первых признаках применяйте фунгициды.",
      "Известковая": "Щелочная среда способствует мучнистой росе. Поддерживайте умеренную влажность и используйте фунгициды.",
      "Песчаная": "Песчаный дренаж предотвращает застой, но низкая влажность может стимулировать рост спор. Регулярно удаляйте зараженные листья.",
      "Супесчаная": "Обеспечьте полив в утренние часы для профилактики, удаляйте зараженные листья.",
      "Болотистая": "Контролируйте уровень воды, избегайте чрезмерного полива и обеспечьте вентиляцию."
    }
  },
  "Mite": {
    "description": "Клещ - мелкие членистоногие, такие как пшеничный клещ, питаются растительными соками, вызывая повреждения",
    "general": "Смывайте клещей водой или слабым мыльным раствором, используйте акарициды при серьезных заражениях.",
    "soil_specific": {
      "Глинистая": "Контролируйте влажность и опрыскивайте растения водой для отпугивания клещей.",
      "Суглинистая": "Регулярные опрыскивания водой помогут снизить численность клещей.",
      "Известковая": "Поддерживайте высокую влажность и опрыскивайте растения водой.",
      "Песчаная": "Из-за хорошего дренажа влажность почвы может быть низкой. Опрыскивание водой поможет отпугнуть клещей.",
      "Супесчаная": "Регулярные опрыскивания водой помогут отпугнуть клещей.",
      "Болотистая": "Высокая влажность снижает активность клещей. При заражении опрыскивайте водой."
    }
  },
  "Septoria": {
    "description": "Септориоз - грибковое заболевание, вызванное Septoria tritici, поражающее листья пшеницы",
    "general": "Удаляйте пораженные листья и применяйте профилактические фунгициды.",
    "soil_specific": {
      "Глинистая": "Снижайте влажность для предотвращения септориоза, удаляйте зараженные листья.",
      "Суглинистая": "Обеспечьте расстояние между растениями для улучшения циркуляции воздуха.",
      "Известковая": "Следите за уровнем pH, чтобы избежать щелочности. Ограничьте полив и применяйте фунгициды.",
      "Песчаная": "Хороший дренаж снижает риск, но удаляйте зараженные листья при появлении болезни.",
      "Супесчаная": "Удаляйте зараженные листья при появлении септориоза.",
      "Болотистая": "Регулярно осматривайте растения, удаляйте больные части и снижайте полив."
    }
  },
  "Smut": {
    "description": "Головня - грибковые заболевания, включая твердую и пыльную головню, поражающие зерновки и ткани растения",
    "general": "Удаляйте остатки зараженных растений и соблюдайте севооборот.",
    "soil_specific": {
      "Глинистая": "Удаляйте растительные остатки после уборки и улучшайте дренаж.",
      "Суглинистая": "Севооборот и удаление растительных остатков помогут снизить риск. Используйте устойчивые сорта.",
      "Известковая": "Добавьте компост для баланса pH и применяйте сертифицированные семена.",
      "Песчаная": "Обеспечьте удаление растительных остатков и используйте здоровые семена.",
      "Супесчаная": "Регулярное удаление растительных остатков и использование здоровых семян.",
      "Болотистая": "Высокий риск заражения, используйте устойчивые сорта и профилактические обработки."
    }
  },
  "Stem Fly": {
    "description": "Стеблевая муха - вредитель, личинки которого повреждают стебли пшеницы, делая ходы внутри и вызывая увядание растений",
    "general": "Применяйте инсектициды и соблюдайте севооборот для предотвращения заражения.",
    "soil_specific": {
      "Глинистая": "Контролируйте влажность, удаляйте зараженные остатки и при необходимости применяйте инсектициды.",
      "Суглинистая": "Внедрите ранние посевы и применяйте инсектициды в сезон.",
      "Известковая": "Следите за состоянием растений, личинки могут развиваться в щелочной среде.",
      "Песчаная": "Ранняя обработка растений инсектицидами при первых признаках заражения.",
      "Супесчаная": "Ранняя обработка растений и применение инсектицидов.",
      "Болотистая": "Контроль влажности, ранние посевы и удаление остатков растений помогут снизить риск."
    }
  },
  "Tan Spot": {
    "description": "Бурая пятнистость - заболевание, вызванное различными грибами (например, Drechslera tritici-repentis), поражающее листья",
    "general": "Применяйте фунгициды при первых признаках заболевания и улучшайте дренаж.",
    "soil_specific": {
      "Глинистая": "Следите за дренажем и удаляйте пораженные листья.",
      "Суглинистая": "Хорошие условия для роста, но соблюдайте севооборот.",
      "Известковая": "Контролируйте pH и переувлажнение, при необходимости применяйте фунгициды.",
      "Песчаная": "Высокий дренаж снижает риск, но при появлении болезни удаляйте пораженные листья.",
      "Супесчаная": "Высокий дренаж снижает риск, при первых признаках болезни применяйте фунгициды.",
      "Болотистая": "Регулярное удаление растительных остатков и снижение полива помогут предотвратить заболевание."
    }
  },
  "Yellow Rust": {
    "description": "Желтая ржавчина - грибковое заболевание, вызванное Puccinia striiformis, поражающее листья и колосья пшеницы",
    "general": "Используйте устойчивые сорта, улучшайте дренаж и применяйте профилактические фунгициды.",
    "soil_specific": {
      "Глинистая": "Улучшите дренаж и используйте устойчивые сорта, чтобы предотвратить болезнь.",
      "Суглинистая": "Следите за умеренной влажностью и проводите севооборот для предотвращения ржавчины.",
      "Известковая": "Снижение уровня pH с помощью органики поможет уменьшить риск заражения.",
      "Песчаная": "Сократите частоту полива и поддерживайте мульчирование для равномерного распределения влаги.",
      "Супесчаная": "Частый полив и добавление органики поддержат устойчивость к ржавчине.",
      "Болотистая": "Контролируйте уровень воды и удаляйте растительные остатки для снижения риска заражения."
    }
  }
}
